Repository: nh36/ChinTransMem
Catalog: corpus/exports/tmx/shijing__xiaoya-yuzao-007__aligned_passages.tmx
Source language: zh_hant
Languages: en

source: 芃芃黍苗，陰雨膏之。悠悠南行，召伯勞之。
en: Tall and strong grows the young millet, Fattened by the genial rains. Very long was our journey to the south, But the earl of Zhou encouraged and cheered us.

source: 我任我輦，我車我牛。我行既集，蓋云歸哉。
en: We carried our burdens; we pushed along our barrows; We drove our waggons; we led our oxen. When our expedition was accomplished, We knew we should return.

source: 我徒我御，我師我旅。我行既集，蓋云歸處。
en: We went along on foot; we rode in our chariots; -- Our whole host, and our battalions. When our expedition was accomplished, We knew we should return home.

source: 肅肅謝功，召伯營之。烈烈征師，召伯成之。
en: Severe was the work at Su, But the earl of Zhou built the city. Majestic was the march of our host; -- The earl of Zhou directed it.

source: 原隰既平，泉流既清。召伯有成，王心則寧。
en: The plains and low lands were regulated; -- The springs and streams were cleared. The earl of Zhou completed his work, And the heart of the king was at rest.
